In [1]:
import pandas as pd
test=pd.read_csv("2salary.csv")
test

   Salary
0   39343
1   46205
2   37731
3   43525
4   39891
5   56642
6   60150
7   54445
8   64445

In [2]:
test.mean()

Salary    49153.0
dtype: float64